In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
import pandas as pd
from sqlalchemy import create_engine, text

engine = create_engine("postgresql+psycopg2://postgres:Mann-147@localhost:5437/bank_capital_db")
print("✅ Connected to bank_capital_db")

✅ Connected to bank_capital_db

In [9]:
schema_tables_sql = """
CREATE SCHEMA IF NOT EXISTS bank;

CREATE TABLE IF NOT EXISTS bank.customers (
    customer_id  SERIAL PRIMARY KEY,
    full_name    VARCHAR(100) NOT NULL,
    phone        VARCHAR(15) UNIQUE,
    email        VARCHAR(100) UNIQUE,
    kyc_status   VARCHAR(20) DEFAULT 'PENDING',
    created_at   TIMESTAMP DEFAULT NOW()
);

CREATE TABLE IF NOT EXISTS bank.accounts (
    account_id     SERIAL PRIMARY KEY,
    customer_id    INT NOT NULL REFERENCES bank.customers(customer_id),
    account_number VARCHAR(20) UNIQUE NOT NULL,
    account_type   VARCHAR(20) NOT NULL CHECK (account_type IN ('SAVINGS','CURRENT')),
    balance        NUMERIC(15,2) DEFAULT 0 CHECK (balance >= 0),
    status         VARCHAR(20) DEFAULT 'ACTIVE',
    opened_at      TIMESTAMP DEFAULT NOW()
);

CREATE TABLE IF NOT EXISTS bank.transactions (
    txn_id         SERIAL PRIMARY KEY,
    from_account   INT REFERENCES bank.accounts(account_id),
    to_account     INT REFERENCES bank.accounts(account_id),
    txn_type       VARCHAR(20) NOT NULL CHECK (txn_type IN ('DEPOSIT','WITHDRAW','TRANSFER')),
    amount         NUMERIC(15,2) NOT NULL CHECK (amount > 0),
    txn_status     VARCHAR(20) DEFAULT 'SUCCESS',
    created_at     TIMESTAMP DEFAULT NOW()
);

CREATE TABLE IF NOT EXISTS bank.audit_log (
    audit_id      SERIAL PRIMARY KEY,
    table_name    VARCHAR(50),
    action        VARCHAR(20),
    record_id     INT,
    old_data      JSONB,
    new_data      JSONB,
    changed_at    TIMESTAMP DEFAULT NOW()
);
"""

with engine.begin() as conn:
    conn.execute(text(schema_tables_sql))

print("✅ Schema + tables created")

✅ Schema + tables created

In [11]:
insert_sql = """
INSERT INTO bank.customers(full_name, phone, email, kyc_status) VALUES
('Rahul Sharma','9999999991','rahul@gmail.com','APPROVED'),
('Ananya Reddy','9999999992','ananya@gmail.com','APPROVED'),
('Imran Khan','9999999993','imran@gmail.com','PENDING')
ON CONFLICT DO NOTHING;

INSERT INTO bank.accounts(customer_id, account_number, account_type, balance) VALUES
(1,'ACC1001','SAVINGS',5000),
(2,'ACC1002','CURRENT',12000),
(3,'ACC1003','SAVINGS',3000)
ON CONFLICT DO NOTHING;
"""

with engine.begin() as conn:
    conn.execute(text(insert_sql))

print("✅ Sample data inserted (or already exists)")

✅ Sample data inserted (or already exists)

In [13]:
import pandas as pd
from sqlalchemy import create_engine, text

engine = create_engine("postgresql+psycopg2://postgres:Mann-147@localhost:5437/bank_capital_db")

print("✅ engine created + connected")
pd.read_sql("SELECT current_database();", engine)

✅ engine created + connected

  current_database
0  bank_capital_db

In [15]:
audit_sql = """
CREATE OR REPLACE FUNCTION bank.fn_audit_accounts()
RETURNS TRIGGER AS $$
BEGIN
    INSERT INTO bank.audit_log(table_name, action, record_id, old_data, new_data)
    VALUES (
        'accounts',
        TG_OP,
        NEW.account_id,
        to_jsonb(OLD),
        to_jsonb(NEW)
    );
    RETURN NEW;
END;
$$ LANGUAGE plpgsql;

DROP TRIGGER IF EXISTS trg_audit_accounts ON bank.accounts;

CREATE TRIGGER trg_audit_accounts
AFTER UPDATE ON bank.accounts
FOR EACH ROW
EXECUTE FUNCTION bank.fn_audit_accounts();
"""

with engine.begin() as conn:
    conn.execute(text(audit_sql))

print("✅ Step 5 done: Audit trigger created")

✅ Step 5 done: Audit trigger created

In [17]:
with engine.begin() as conn:
    conn.execute(text("UPDATE bank.accounts SET balance = balance + 50 WHERE account_id = 1;"))

print("✅ Account updated")

✅ Account updated

In [19]:
proc_sql_fixed = """
CREATE OR REPLACE PROCEDURE bank.transfer_money(
    p_from_account INT,
    p_to_account   INT,
    p_amount       NUMERIC
)
LANGUAGE plpgsql
AS $$
DECLARE
    v_balance NUMERIC;
BEGIN
    -- Lock sender row
    SELECT balance INTO v_balance
    FROM bank.accounts
    WHERE account_id = p_from_account
    FOR UPDATE;

    IF v_balance IS NULL THEN
        RAISE EXCEPTION 'From account not found';
    END IF;

    IF v_balance < p_amount THEN
        RAISE EXCEPTION 'Insufficient funds';
    END IF;

    -- Lock receiver
    PERFORM 1
    FROM bank.accounts
    WHERE account_id = p_to_account
    FOR UPDATE;

    IF NOT FOUND THEN
        RAISE EXCEPTION 'To account not found';
    END IF;

    -- Debit sender
    UPDATE bank.accounts
    SET balance = balance - p_amount
    WHERE account_id = p_from_account;

    -- Credit receiver
    UPDATE bank.accounts
    SET balance = balance + p_amount
    WHERE account_id = p_to_account;

    -- Log transaction
    INSERT INTO bank.transactions(from_account, to_account, txn_type, amount)
    VALUES(p_from_account, p_to_account, 'TRANSFER', p_amount);

END;
$$;
"""

with engine.begin() as conn:
    conn.execute(text(proc_sql_fixed))

print("✅ Procedure recreated WITHOUT COMMIT")

✅ Procedure recreated WITHOUT COMMIT

In [21]:
with engine.begin() as conn:
    conn.execute(text("CALL bank.transfer_money(1, 2, 700);"))

print("✅ Transfer executed successfully")

✅ Transfer executed successfully

In [23]:
view_sql = """
CREATE OR REPLACE VIEW bank.account_summary AS
SELECT
    c.customer_id,
    c.full_name,
    a.account_id,
    a.account_number,
    a.account_type,
    a.balance,
    a.status
FROM bank.customers c
JOIN bank.accounts a ON c.customer_id = a.customer_id;
"""

with engine.begin() as conn:
    conn.execute(text(view_sql))

print("✅ Step 8 done: account_summary view created")

✅ Step 8 done: account_summary view created

In [25]:
pd.read_sql("SELECT * FROM bank.account_summary ORDER BY customer_id;", engine)

,customer_id,full_name,account_id,account_number,account_type,balance,status
0,1,Rahul Sharma,1,ACC1001,SAVINGS,3200.0,ACTIVE
1,2,Ananya Reddy,2,ACC1002,CURRENT,13900.0,ACTIVE
2,3,Imran Khan,3,ACC1003,SAVINGS,3000.0,ACTIVE

In [27]:
pd.read_sql("""
SELECT txn_id, from_account, to_account, txn_type, amount, created_at
FROM bank.transactions
ORDER BY created_at DESC
LIMIT 10;
""", engine)

,txn_id,from_account,to_account,txn_type,amount,created_at
0,6,1,2,TRANSFER,700.0,2026-01-16 15:26:16.770946
1,5,1,2,TRANSFER,500.0,2026-01-16 15:11:47.758542
2,4,1,2,TRANSFER,700.0,2026-01-16 15:07:55.071350

In [31]:
pd.read_sql("""
SELECT audit_id, action, record_id, old_data, new_data, changed_at
FROM bank.audit_log
ORDER BY changed_at DESC
LIMIT 5;
""", engine)

,audit_id,action,record_id,old_data,new_data,changed_at
0,14,UPDATE,2,"{'status': 'ACTIVE', 'balance': 13200.0, 'open...","{'status': 'ACTIVE', 'balance': 13900.0, 'open...",2026-01-16 15:26:16.770946
1,13,UPDATE,1,"{'status': 'ACTIVE', 'balance': 3900.0, 'opene...","{'status': 'ACTIVE', 'balance': 3200.0, 'opene...",2026-01-16 15:26:16.770946
2,12,UPDATE,1,"{'status': 'ACTIVE', 'balance': 3850.0, 'opene...","{'status': 'ACTIVE', 'balance': 3900.0, 'opene...",2026-01-16 15:25:40.904279
3,11,UPDATE,2,"{'status': 'ACTIVE', 'balance': 12700.0, 'open...","{'status': 'ACTIVE', 'balance': 13200.0, 'open...",2026-01-16 15:11:47.758542
4,10,UPDATE,1,"{'status': 'ACTIVE', 'balance': 4350.0, 'opene...","{'status': 'ACTIVE', 'balance': 3850.0, 'opene...",2026-01-16 15:11:47.758542

In [33]:
pd.read_sql("SELECT account_id, account_number, balance FROM bank.accounts ORDER BY account_id;", engine)

   account_id account_number  balance
0           1        ACC1001   3200.0
1           2        ACC1002  13900.0
2           3        ACC1003   3000.0

In [35]:
with engine.begin() as conn:
    conn.execute(text("CALL bank.transfer_money(1,2,500);"))
print("✅ Transfer executed")

✅ Transfer executed

In [37]:
pd.read_sql("SELECT account_id, account_number, balance FROM bank.accounts ORDER BY account_id;", engine)

   account_id account_number  balance
0           1        ACC1001   2700.0
1           2        ACC1002  14400.0
2           3        ACC1003   3000.0

In [39]:
pd.read_sql("""
EXPLAIN ANALYZE
SELECT *
FROM bank.transactions
WHERE from_account = 1
ORDER BY created_at DESC;
""", engine)

                                          QUERY PLAN
0  Sort  (cost=1.02..1.03 rows=1 width=154) (actu...
1                          Sort Key: created_at DESC
2               Sort Method: quicksort  Memory: 25kB
3    ->  Seq Scan on transactions  (cost=0.00..1....
4                         Filter: (from_account = 1)
5                            Planning Time: 8.272 ms
6                           Execution Time: 4.123 ms